<h1>Pandas</h1>

In [ ]:
-Pandas tabular datadan oluşan bir dataframeden türetilir. Pandasın kullanıldığı
data, row ve columndan oluşur. Datayı keşfetme, temizleme ve işlemeye yarar.

-Bir veri setini incelemenin birkaç yolu var. <br>
 -table_name.head(): Bu fonksiyon, ilgili tablonun ilk birkaç satırını döndürmeye yarar.<br>
 -table_name.info(): sütun adlarını, içerdiği veri türlerini ve eksik değerleri olup olmadığını belirtir.<br>
 -table_name.shape: dataframe'in satır ve sütun sayısını tutan bir tiuple içerir.<br>
 -table_name.describe(): sayısal sütunlar için, ortalama ve medyan gibi özet istatistikleri içerir.<br>
 -table_name.values: veri değerlerinin tamamını array olarak alma.<br>
 -table_name.columns: dataframedeki tüm sütunları çıktı olarak alma.<br>

In [5]:
import pandas as pd ##Pandası import ettik.
import numpy as np

In [6]:
columns = ['Student ID', 'Course ID', 'Marks']
data = [(103, 201, 67), (103, 203, 67), (103, 204, 89)]
df = pd.DataFrame(data, columns=columns)
df.at['Total marks', 'Marks'] = df['Marks'].sum()

print(df)

             Student ID  Course ID  Marks
0                 103.0      201.0   67.0
1                 103.0      203.0   67.0
2                 103.0      204.0   89.0
Total marks         NaN        NaN  223.0

In [25]:
dates = pd.date_range("20240101", periods=20)b
df = pd.DataFrame(np.random.randn(20, 4), index=dates, columns=list("ABCD"))
print(df)

                   A         B         C         D
2024-01-01 -0.506442  1.646989  0.005751  1.693598
2024-01-02  1.130911 -0.273436 -0.392463 -0.876651
2024-01-03  1.372611 -0.620330  0.186472  1.732989
2024-01-04  1.271317  2.105170 -1.717091  0.851536
2024-01-05 -0.574182 -0.222342  0.531456  0.504468
2024-01-06  0.338162 -1.753595  0.437520 -0.905221
2024-01-07  0.591405 -1.517755 -0.142085  0.529244
2024-01-08  0.149237  0.380452 -0.065960  0.140827
2024-01-09 -0.145122  0.977379  0.111483 -1.316002
2024-01-10  0.203301  1.831420  0.194537 -0.001698
2024-01-11 -1.412488 -1.017399 -1.419120  0.679401
2024-01-12  0.424670  0.505506  1.614453  0.633303
2024-01-13 -1.288865 -1.158552  0.119063  0.833258
2024-01-14 -0.326605  2.908319  0.929256  0.555645
2024-01-15  0.070098 -0.942199  1.047593 -1.402771
2024-01-16  1.881751 -0.261549  1.203383 -0.546573
2024-01-17  0.469158  0.737771 -0.399435 -0.787274
2024-01-18  0.068616 -1.284861 -0.649568  0.161002
2024-01-19  0.384646  0.639339  0.086787  0.001129
2024-01-20  0.104824 -1.446490 -0.459677 -0.396577

In [26]:
df.head() ##ilk birkaç satırını veriyor.

                   A         B         C         D
2024-01-01 -0.506442  1.646989  0.005751  1.693598
2024-01-02  1.130911 -0.273436 -0.392463 -0.876651
2024-01-03  1.372611 -0.620330  0.186472  1.732989
2024-01-04  1.271317  2.105170 -1.717091  0.851536
2024-01-05 -0.574182 -0.222342  0.531456  0.504468

In [27]:
df.info ##tablo ile alaklı bilgi veriyor.

<bound method DataFrame.info of                    A         B         C         D
2024-01-01 -0.506442  1.646989  0.005751  1.693598
2024-01-02  1.130911 -0.273436 -0.392463 -0.876651
2024-01-03  1.372611 -0.620330  0.186472  1.732989
2024-01-04  1.271317  2.105170 -1.717091  0.851536
2024-01-05 -0.574182 -0.222342  0.531456  0.504468
2024-01-06  0.338162 -1.753595  0.437520 -0.905221
2024-01-07  0.591405 -1.517755 -0.142085  0.529244
2024-01-08  0.149237  0.380452 -0.065960  0.140827
2024-01-09 -0.145122  0.977379  0.111483 -1.316002
2024-01-10  0.203301  1.831420  0.194537 -0.001698
2024-01-11 -1.412488 -1.017399 -1.419120  0.679401
2024-01-12  0.424670  0.505506  1.614453  0.633303
2024-01-13 -1.288865 -1.158552  0.119063  0.833258
2024-01-14 -0.326605  2.908319  0.929256  0.555645
2024-01-15  0.070098 -0.942199  1.047593 -1.402771
2024-01-16  1.881751 -0.261549  1.203383 -0.546573
2024-01-17  0.469158  0.737771 -0.399435 -0.787274
2024-01-18  0.068616 -1.284861 -0.649568  0.161002
2024-01-19  0.384646  0.639339  0.086787  0.001129
2024-01-20  0.104824 -1.446490 -0.459677 -0.396577>

In [29]:
df.shape ##satır ve sütun sayısını veriyor.

(20, 4)

In [30]:
df.describe()

               A          B          C          D
count  20.000000  20.000000  20.000000  20.000000
mean    0.210350   0.061692   0.061118   0.104182
std     0.824054   1.340730   0.809651   0.894104
min    -1.412488  -1.753595  -1.717091  -1.402771
25%    -0.190493  -1.052687  -0.394206  -0.606748
50%     0.176269  -0.241945   0.099135   0.150915
75%     0.499720   0.797673   0.461004   0.644827
max     1.881751   2.908319   1.614453   1.732989

In [32]:
df.values

array([[-5.06442403e-01,  1.64698871e+00,  5.75119803e-03,
         1.69359798e+00],
       [ 1.13091078e+00, -2.73436028e-01, -3.92462549e-01,
        -8.76650782e-01],
       [ 1.37261112e+00, -6.20330359e-01,  1.86471822e-01,
         1.73298898e+00],
       [ 1.27131745e+00,  2.10516990e+00, -1.71709077e+00,
         8.51536376e-01],
       [-5.74181518e-01, -2.22342023e-01,  5.31456091e-01,
         5.04468303e-01],
       [ 3.38162263e-01, -1.75359490e+00,  4.37519608e-01,
        -9.05221097e-01],
       [ 5.91405061e-01, -1.51775505e+00, -1.42085440e-01,
         5.29244414e-01],
       [ 1.49237227e-01,  3.80451667e-01, -6.59602397e-02,
         1.40827230e-01],
       [-1.45122347e-01,  9.77378537e-01,  1.11482528e-01,
        -1.31600242e+00],
       [ 2.03301413e-01,  1.83142011e+00,  1.94536776e-01,
        -1.69825127e-03],
       [-1.41248816e+00, -1.01739894e+00, -1.41911979e+00,
         6.79401388e-01],
       [ 4.24669921e-01,  5.05505954e-01,  1.61445275e+00,
         6.33302648e-01],
       [-1.28886499e+00, -1.15855190e+00,  1.19063010e-01,
         8.33258332e-01],
       [-3.26604587e-01,  2.90831900e+00,  9.29256048e-01,
         5.55645348e-01],
       [ 7.00981359e-02, -9.42198909e-01,  1.04759322e+00,
        -1.40277113e+00],
       [ 1.88175107e+00, -2.61548867e-01,  1.20338309e+00,
        -5.46572701e-01],
       [ 4.69158342e-01,  7.37770842e-01, -3.99435269e-01,
        -7.87273628e-01],
       [ 6.86159706e-02, -1.28486140e+00, -6.49568344e-01,
         1.61002480e-01],
       [ 3.84645664e-01,  6.39339457e-01,  8.67865365e-02,
         1.12912744e-03],
       [ 1.04823995e-01, -1.44648992e+00, -4.59676961e-01,
        -3.96576503e-01]])

In [33]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [41]:
dates = pd.date_range(start = "01/01/2024", periods = 12, freq = 'M') #ay bazlı

In [42]:
print(dates)

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31',
               '2024-09-30', '2024-10-31', '2024-11-30', '2024-12-31'],
              dtype='datetime64[ns]', freq='M')

-table_name.sort_values("sortlanmak istenen column") <br>
-bu metod ile veriyi <b>küçükten büyüğe</b>  sıralayabiliriz. <br>
-table_name.sort_values("sortlanmak istenen column", ascending=False) <br>
-bu metod ile <b>büyükten küçüğe</b> sıralama yapabiliriz. <br>
-table_name.sort_values("sortlanmak istenen column", "sortlanmak istenen diğer column") <br>

In [45]:
df.sort_values("A", b)

                   A         B         C         D
2024-01-16  1.881751 -0.261549  1.203383 -0.546573
2024-01-03  1.372611 -0.620330  0.186472  1.732989
2024-01-04  1.271317  2.105170 -1.717091  0.851536
2024-01-02  1.130911 -0.273436 -0.392463 -0.876651
2024-01-07  0.591405 -1.517755 -0.142085  0.529244
2024-01-17  0.469158  0.737771 -0.399435 -0.787274
2024-01-12  0.424670  0.505506  1.614453  0.633303
2024-01-19  0.384646  0.639339  0.086787  0.001129
2024-01-06  0.338162 -1.753595  0.437520 -0.905221
2024-01-10  0.203301  1.831420  0.194537 -0.001698
2024-01-08  0.149237  0.380452 -0.065960  0.140827
2024-01-20  0.104824 -1.446490 -0.459677 -0.396577
2024-01-15  0.070098 -0.942199  1.047593 -1.402771
2024-01-18  0.068616 -1.284861 -0.649568  0.161002
2024-01-09 -0.145122  0.977379  0.111483 -1.316002
2024-01-14 -0.326605  2.908319  0.929256  0.555645
2024-01-01 -0.506442  1.646989  0.005751  1.693598
2024-01-05 -0.574182 -0.222342  0.531456  0.504468
2024-01-13 -1.288865 -1.158552  0.119063  0.833258
2024-01-11 -1.412488 -1.017399 -1.419120  0.679401

-table_name["column_name"], ilgili dataframein tek bir satırını almak için kullanılır<br>
-birden fazla satır almak için, table_name[["column_name1","column_name2"]]<br>
-yukarıdaki işlemde, dış parantezler ilgili data frame'in alt kümesini almaya yarıyorken, iç parantezler almak istediğimiz kısmın columnlarını içeriyor.

In [59]:
half_df = df[["A","B"]]

In [60]:
print(half_df)

                   A         B
2024-01-01 -0.506442  1.646989
2024-01-02  1.130911 -0.273436
2024-01-03  1.372611 -0.620330
2024-01-04  1.271317  2.105170
2024-01-05 -0.574182 -0.222342
2024-01-06  0.338162 -1.753595
2024-01-07  0.591405 -1.517755
2024-01-08  0.149237  0.380452
2024-01-09 -0.145122  0.977379
2024-01-10  0.203301  1.831420
2024-01-11 -1.412488 -1.017399
2024-01-12  0.424670  0.505506
2024-01-13 -1.288865 -1.158552
2024-01-14 -0.326605  2.908319
2024-01-15  0.070098 -0.942199
2024-01-16  1.881751 -0.261549
2024-01-17  0.469158  0.737771
2024-01-18  0.068616 -1.284861
2024-01-19  0.384646  0.639339
2024-01-20  0.104824 -1.446490

-dogs[dogs["height_cm"] > 50] --> Bu kod bloğu, boyu 50 cm'den yüksek olan köpeklerin filtrelenmesine yaramaktadır. <br>
-dogs[dogs["tür"] == "Labrador"] --> Bu kod bloğu, labrador cinsi köpeklerin filtrelenmesine yarıyor. <br>
-dogs[dogs["date_of_birth"] < "2015-01-01"] --> bu kod bloğu, tarihsel olarak 2015 yılından önce doğan tüm köpeklerin filtrelenmesine yarıyor.
-is_height = dogs[dogs["height_cm"] > 50] <br>
-is_breed = dogs[dogs["tür"] == "Labrador"] <br>
-dogs[is_height & is_breed] --> iki filtrenin birleştirilmesi <br>
-birleştirmenin tek satır hali --> dogs[(dogs["height_cm"] > 50) & (dogs["tür"] == "Labrador")] <br>
-is_black_or_brown = dogs["color"].isin(["Black","Brown"]) --> isin metodu ile birden fazla filtreleme değeri atabiliyoruz.

In [89]:
data = [(103, 201, 67,'fatih'), (103, 203, 67), (103, 204, 89), (13, 24, 81)]
df = pd.DataFrame(data, columns = ['Student ID', 'Course ID', 'Marks','AUM'])


print(df)

   Student ID  Course ID  Marks    AUM
0         103        201     67  fatih
1         103        203     67   None
2         103        204     89   None
3          13         24     81   None

In [109]:
mdata = [(123,'fatih','türkiye',3000),
        (345,'tuğçe','makedonya',4000),
        (678,'gökmen','ısparta',5000),
        (91011,'ayşegül','kapaklı',6000),
       (121314,'mehmet','sütçüler',7000),
       (151617,'fatma','belen',9000),
       (181920,'ahmet','beylikdüzü',10000)]

In [110]:
mdf = pd.DataFrame(mdata,columns=['Cust ID','Full NM','Country','AUM'])
print(mdf)

   Cust ID  Full NM     Country    AUM
0      123    fatih     türkiye   3000
1      345    tuğçe   makedonya   4000
2      678   gökmen     ısparta   5000
3    91011  ayşegül     kapaklı   6000
4   121314   mehmet    sütçüler   7000
5   151617    fatma       belen   9000
6   181920    ahmet  beylikdüzü  10000

In [115]:
mdf.head() ##ilk birkaç satırı aldım.

   Cust ID  Full NM    Country   AUM
0      123    fatih    türkiye  3000
1      345    tuğçe  makedonya  4000
2      678   gökmen    ısparta  5000
3    91011  ayşegül    kapaklı  6000
4   121314   mehmet   sütçüler  7000

In [117]:
mdf.describe ##tabloyu tanımladım.

<bound method NDFrame.describe of    Cust ID  Full NM     Country    AUM
0      123    fatih     türkiye   3000
1      345    tuğçe   makedonya   4000
2      678   gökmen     ısparta   5000
3    91011  ayşegül     kapaklı   6000
4   121314   mehmet    sütçüler   7000
5   151617    fatma       belen   9000
6   181920    ahmet  beylikdüzü  10000>

In [121]:
mdf.columns ##kolonlara baktık

Index(['Cust ID', 'Full NM', 'Country', 'AUM'], dtype='object')

In [122]:
mdf.shape ##satır ve sütun sayılarına baktık

(7, 4)

In [126]:
mdf.describe() ##sayısal sütunları özetledik.

             Cust ID           AUM
count       7.000000      7.000000
mean    78144.000000   6285.714286
std     77822.330227   2563.479778
min       123.000000   3000.000000
25%       511.500000   4500.000000
50%     91011.000000   6000.000000
75%    136465.500000   8000.000000
max    181920.000000  10000.000000

In [127]:
mdf.sort_values("AUM") ##smallest to largest sort

   Cust ID  Full NM     Country    AUM
0      123    fatih     türkiye   3000
1      345    tuğçe   makedonya   4000
2      678   gökmen     ısparta   5000
3    91011  ayşegül     kapaklı   6000
4   121314   mehmet    sütçüler   7000
5   151617    fatma       belen   9000
6   181920    ahmet  beylikdüzü  10000

In [128]:
mdf.sort_values("AUM", ascending = False)

   Cust ID  Full NM     Country    AUM
6   181920    ahmet  beylikdüzü  10000
5   151617    fatma       belen   9000
4   121314   mehmet    sütçüler   7000
3    91011  ayşegül     kapaklı   6000
2      678   gökmen     ısparta   5000
1      345    tuğçe   makedonya   4000
0      123    fatih     türkiye   3000

In [1]:
mdata = [(123,'fatih','makedonya',23,3000),
        (345,'tuğçe','tekirdağ',22,4000),
        (678,'gökmen','manastır',53,5000),
        (91011,'ayşegül','ısparta',51,6000),
       (121314,'mehmet','sütçüler',81,7000),
       (151617,'tito','çukurbostan',64,9000),
       (181920,'toto','çukurbostan',62,10000)]

In [3]:
import pandas as pd

In [4]:
mdf = pd.DataFrame(mdata,columns=['Cust ID','Full NM','Country','Age','AUM'])
print(mdf)

   Cust ID  Full NM      Country  Age    AUM
0      123    fatih    makedonya   23   3000
1      345    tuğçe     tekirdağ   22   4000
2      678   gökmen     manastır   53   5000
3    91011  ayşegül      ısparta   51   6000
4   121314   mehmet     sütçüler   81   7000
5   151617     tito  çukurbostan   64   9000
6   181920     toto  çukurbostan   62  10000

In [188]:
mdf.sort_values("AUM", ascending=False)

   Cust ID  Full NM      Country  Age    AUM
6   181920     toto  çukurbostan   62  10000
5   151617     tito  çukurbostan   64   9000
4   121314   mehmet     sütçüler   81   7000
3    91011  ayşegül      ısparta   51   6000
2      678   gökmen     manastır   53   5000
1      345    tuğçe     tekirdağ   22   4000
0      123    fatih    makedonya   23   3000

In [189]:
mdf.sort_values(["AUM","Age"],ascending=[True,False])

   Cust ID  Full NM      Country  Age    AUM
0      123    fatih    makedonya   23   3000
1      345    tuğçe     tekirdağ   22   4000
2      678   gökmen     manastır   53   5000
3    91011  ayşegül      ısparta   51   6000
4   121314   mehmet     sütçüler   81   7000
5   151617     tito  çukurbostan   64   9000
6   181920     toto  çukurbostan   62  10000

In [190]:
mdf[mdf["AUM"]>=4000]

   Cust ID  Full NM      Country  Age    AUM
1      345    tuğçe     tekirdağ   22   4000
2      678   gökmen     manastır   53   5000
3    91011  ayşegül      ısparta   51   6000
4   121314   mehmet     sütçüler   81   7000
5   151617     tito  çukurbostan   64   9000
6   181920     toto  çukurbostan   62  10000

In [191]:
mdf[mdf["Country"]=="çukurbostan"]

   Cust ID Full NM      Country  Age    AUM
5   151617    tito  çukurbostan   64   9000
6   181920    toto  çukurbostan   62  10000

In [192]:
mdf[(mdf["Country"]=="sütçüler")&(mdf["Age"]==81)] ##ikili filtre

   Cust ID Full NM   Country  Age   AUM
4   121314  mehmet  sütçüler   81  7000

In [193]:
mdf

   Cust ID  Full NM      Country  Age    AUM
0      123    fatih    makedonya   23   3000
1      345    tuğçe     tekirdağ   22   4000
2      678   gökmen     manastır   53   5000
3    91011  ayşegül      ısparta   51   6000
4   121314   mehmet     sütçüler   81   7000
5   151617     tito  çukurbostan   64   9000
6   181920     toto  çukurbostan   62  10000

In [196]:
count = mdf.shape[0]

In [197]:
mdf["AUM_AVE"] = mdf["AUM"]/count #yeni satır ekleme

In [198]:
mdf

   Cust ID  Full NM      Country  Age    AUM      AUM_AVE
0      123    fatih    makedonya   23   3000   428.571429
1      345    tuğçe     tekirdağ   22   4000   571.428571
2      678   gökmen     manastır   53   5000   714.285714
3    91011  ayşegül      ısparta   51   6000   857.142857
4   121314   mehmet     sütçüler   81   7000  1000.000000
5   151617     tito  çukurbostan   64   9000  1285.714286
6   181920     toto  çukurbostan   62  10000  1428.571429

In [200]:
mdf

   Cust ID  Full NM      Country  Age    AUM      AUM_AVE
0      123    fatih    makedonya   23   3000   428.571429
1      345    tuğçe     tekirdağ   22   4000   571.428571
2      678   gökmen     manastır   53   5000   714.285714
3    91011  ayşegül      ısparta   51   6000   857.142857
4   121314   mehmet     sütçüler   81   7000  1000.000000
5   151617     tito  çukurbostan   64   9000  1285.714286
6   181920     toto  çukurbostan   62  10000  1428.571429

In [7]:
mdf["AUM"].mean()

6285.714285714285

In [8]:
mdf["AUM"].median()

6000.0

In [9]:
mdf["AUM"].mode()

0     3000
1     4000
2     5000
3     6000
4     7000
5     9000
6    10000
Name: AUM, dtype: int64

In [10]:
mdf["AUM"].sum()

44000

In [11]:
# Print the head of the sales DataFrame
print(mdf.head())

# Print the info about the sales DataFrame
print(mdf.info())

# Print the mean of weekly_sales
print(mdf["AUM"].mean())

# Print the median of weekly_sales
print(mdf["AUM"].median())

   Cust ID  Full NM    Country  Age   AUM
0      123    fatih  makedonya   23  3000
1      345    tuğçe   tekirdağ   22  4000
2      678   gökmen   manastır   53  5000
3    91011  ayşegül    ısparta   51  6000
4   121314   mehmet   sütçüler   81  7000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Cust ID  7 non-null      int64
 1   Full NM  7 non-null      object
 2   Country  7 non-null      object
 3   Age      7 non-null      int64
 4   AUM      7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 408.0+ bytes
None
6285.714285714285
6000.0

*Duplicate valueları silmek
-tekrar eden aynı değerleri silmek için kullanılan metod.
--unique_dogs = vet_visits.drop_duplicates(subset="name") --> bu kod ile, birden fazla kez veterinere gitmiş olan name kolonundaki köpekleri sileceğiz ve tek değere düşüreceğiz.
--birden fazla kolona duplicate atmak için, alt küme oluşturuyoruz.
--unique_dogs = vet_visits.drop_duplicates(subset = ["name", "breed"])
--bu değerleri saydırmak için --> unique_dogs["breed"].value_counts() eğer sortlamak istiyorsak, value_counts metodunun içinde sort yazarsak output istediğimiz türden sıralı hale gelecek.
--eğer oran bazında bakmak istersek, value_counts(normalize=True)

In [ ]:
# Count the number of stores of each type
store_counts = store_types["type"].value_counts()
print(store_counts)

# Get the proportion of stores of each type
store_props = store_types["type"].value_counts(normalize = True)
print(store_props)

# Count the number of stores for each department and sort
dept_counts_sorted = store_depts["department"].value_counts(sort = True )
print(dept_counts_sorted)

# Get the proportion of stores in each department and sort
dept_props_sorted = store_depts["department"].value_counts(sort= True, normalize= True)
print(dept_props_sorted)